//#include<stdio.h>
//int main()
//{
//	int a = 60;
//	if (a < 60)                              //条件可以是浮点型
//	{
//		printf("不及格");
//	}
//	                                         //中间有且仅能有空格
//	else                                     //二选一
//	{
//		printf("及格");
//	}
//	//////////////////////////////////////////if else嵌套
//	if(1)
//	{
//		if (a < 60)
//		{
//			printf("不及格");
//		}
//		else                                     //二选一
//		{
//			printf("及格");
//		}
//	}
//	else
//	{
//		if (a < 60)
//		{
//			printf("不及格");
//		}
//		else                                     //二选一
//		{
//			printf("及格");
//		}
//	}
//	//////////////////////////////////////////
//	1 ? printf("if执行") : printf("else执行");   //适合简单if条件句
//}