//#include<stdio.h>
//
//    int main(void)
//{
//	printf("%d\n",5201314);                                   //格式化输出符号，转义字符
//	printf("我喜欢的数字，%d\n", 7);                           //int 四字节，12万范围，-65536~65535	
//	printf("%d天%d小时%d秒\n",1,24,23);                       //译为一天二十四小时23,顺序填充
//	printf("这是%x个\n", 12);                                 //译为c，是十六进制
//	printf("%x,%d,%X,%o,%O\n", 12,12,12,12,12);              //只有十六进制能用%X（大写）
//	printf("%o\n", 12);                                       //译为14，是八进制
//                                                            // %s是字符串，%d是十进制，u用于无符号整形，%x是16进制，%o是8进制，z用于测大小，
//	return 0;
//}
