//#include<stdio.h>
//#include<stdlib.h>
//int main(void)
//{
// //  指针的大小：32位程序（软件）最大支持4字节，64位程序（软件）最大支持8字节
// //  win32，win64，x64，x86（32位）
// //  原理：一字节8位，4*8==32，8*8==64
// //  指针书写规范：int (*)[2][3],int (*)[4];错误书写：int *[2][3],此为数组
// 
//	int a = 12;                             //b是bit的缩写，表示字节存储空间，如1kb/s
//	int b = 13;                             //%p代表默认用十六进制取地址，具有特殊性；
//	int* p;
//	p= &a;                                  //p指向int类型的a所在的空间
//	
//	printf("%d  %p  %p\n", a, p,&p);
//	// ///////////////////////////////////////
//	p = &b;
//
//	//关于偏移量和野指针
//	p[2] = 20;           //实际不存在p[2]，此时p[2]是野指针
//	p[0] = 15;           //注：地址+偏移量是一种运算符，不止针对数组，也适用指针
//	
//	//*p = 14;
//	printf("%d  %d\n", *p, b);               //小范围指针可指向大范围空间，但大范围指针指向小范围空间是非法的   
//	// //////////////////////////////////////
//	int d[5] = { 2,4,3,1,5 };
//	int* p1 = &d[0];
//	//for (int i = 0; i <= 4; i++)
//	//{
//	//	//printf("%d  ", *(p1 + i));
//	//	printf("%d  ", *p1++);
//	//}
//
//	int** p2 = &p1;
//	**p2 = 0;                                        //二级指针，套娃
//	printf("%d,%d", **p2, d[0]);                     //地址+[偏移量]==遍历数据
//
//	return 0;
//}