//#include<stdio.h>
//void main(void)
//{
//	int a = 12;
//	a++;                          //此时a已经是13
//	printf("%d\n", a++);          //输出12,后缀用原值参与运算，优先级最高，前缀其次
//	                              //3++不存在
//	--a;
//	printf("%d\n", --a);          //12
//	int b;
//	b = a++;
//	printf("%d,%d\n", a, b);        //13,12,根据优先级理论，先自加再赋值，两者互不干涉
//	//printf("%d", (a++ * 2) + (--b+ 3));//不能出现同一变量的多个自加自减运算符
//	//b=a+=8;a-=2,a/=4,a%6,a*=8;
//	b = a -= 3 + 2;               //8,优先级仅在赋值运算符之前，所以先算+号,不遵循采用原值计算原则
//	printf("%d", b);
//0，o,O
//
//}